SELECT 
[Подразделение]
      ,[ГруппаПлановПродаж]
      ,[АвторСделки]
      ,[VariationCalculate]
      ,[КварталМотивации]
      ,[ТипКоэф]
      ,[СуммаМотивацииUSD]
      ,[СуммаМотивацииUSDУчетПроцента]
      ,[СуммаПланUSDКварталValue]
      ,[СуммаОтгрузокUSDКварталValue]
,Остаток
,IIF(КварталМотивации=@qm,1,0)*[СуммаМотивацииUSD] [СуммаМотивацииUSDQ]
,IIF(КварталМотивации=@qm,1,0)*[СуммаМотивацииUSDУчетПроцента] [СуммаМотивацииUSDУчетПроцентаQ]
,IIF(КварталМотивации=@qm,1,0)*[СуммаПланUSDКварталValue] [СуммаПланUSDКварталValueQ]
,IIF(КварталМотивации=@qm,1,0)*[СуммаПланUSDКварталValue]*IIF([VariationCalculate]='Подразделение',NULL,1) [СуммаПланUSDКварталValueQG]
,IIF(КварталМотивации=@qm,1,0)*[СуммаОтгрузокUSDКварталValue] [СуммаОтгрузокUSDКварталValueQ]
--year
--q
,IIF(КварталМотивации<>'Год',1,0)*[СуммаМотивацииUSD]                                           [СуммаМотивацииUSDQ_Y]
,IIF(КварталМотивации<>'Год',1,0)*[СуммаМотивацииUSDУчетПроцента]                  [СуммаМотивацииUSDУчетПроцентаQ_Y]
--y
,IIF(КварталМотивации='Год',1,0)*[СуммаМотивацииUSD]                                              [СуммаМотивацииUSDY_Y]
,IIF(КварталМотивации='Год',1,0)*[СуммаМотивацииUSDУчетПроцента]                    [СуммаМотивацииUSDУчетПроцентаY_Y]
,IIF(КварталМотивации='Год',1,0)*[СуммаПланUSDКварталValue]                                  [СуммаПланUSDКварталValue_Y]
,IIF(КварталМотивации='Год',1,0)*[СуммаПланUSDКварталValue]*IIF([VariationCalculate]='Подразделение',NULL,1) [СуммаПланUSDКварталValueYG]
,IIF(КварталМотивации='Год',1,0)*[СуммаОтгрузокUSDКварталValue] [СуммаОтгрузокUSDКварталValue_Y]
--sub
--q
,NULL  [СуммаПланUSD_S_Q]
,NULL	[СуммаОтгрузокUSD_S_Q]
--y
,NULL  [СуммаПланUSD_S_Y]
,NULL	[СуммаОтгрузокUSD_S_Y]
FROM 
DataWH.motivation.vReportMotivationByDealAuthorForAAuthor
WHERE 
Подразделение IN (@Subdivision)
AND АвторСделки IN (@DealAuthor)
AND ТипКоэф = @TypeCoeff_
AND ГруппаПлановПродаж IN (@gp_sales)


UNION ALL

SELECT 
[Подразделение]
      ,[ГруппаПлановПродаж]
      ,[АвторСделки]
      ,[VariationCalculate]
      ,[КварталМотивации]
      ,[ТипКоэф]
      ,NULL [СуммаМотивацииUSD]
      ,NULL [СуммаМотивацииUSDУчетПроцента]
      ,NULL [СуммаПланUSDКварталValue]
      ,NULL [СуммаОтгрузокUSDКварталValue]
,NULL Остаток
,NULL  [СуммаМотивацииUSDQ]
,NULL  [СуммаМотивацииUSDУчетПроцентаQ]
,NULL  [СуммаПланUSDКварталValueQ]
,NULL  [СуммаПланUSDКварталValueQG]
,NULL  [СуммаОтгрузокUSDКварталValueQ]
--year
--q
,NULL                                            [СуммаМотивацииUSDQ_Y]
,NULL                   [СуммаМотивацииUSDУчетПроцентаQ_Y]
--y
,NULL                                             [СуммаМотивацииUSDY_Y]
,NULL                    [СуммаМотивацииUSDУчетПроцентаY_Y]
,NULL                                   [СуммаПланUSDКварталValue_Y]
,NULL  [СуммаПланUSDКварталValueYG]
,NULL  [СуммаОтгрузокUSDКварталValue_Y]
--sub
--q
,IIF(КварталМотивации=@qm,1,0)*[СуммаПланUSDКварталValue]  [СуммаПланUSD_S_Q]
,IIF(КварталМотивации=@qm,1,0)*[СуммаОтгрузокUSDКварталValue]	[СуммаОтгрузокUSD_S_Q]
--y
,IIF(КварталМотивации='Год',1,0)*[СуммаПланUSDКварталValue]  [СуммаПланUSD_S_Y]
,IIF(КварталМотивации='Год',1,0)*[СуммаОтгрузокUSDКварталValue]	[СуммаОтгрузокUSD_S_Y]
FROM 
DataWH.motivation.vReportMotivationByDealAuthorForAAuthor
WHERE 
Подразделение IN (@Subdivision)

AND ТипКоэф = @TypeCoeff_
AND ГруппаПлановПродаж IN (@gp_sales)